// Напишите цикл, который принимает на вход 
//два числа (A и B) и возводит число A в натуральную степень B.

Console.WriteLine("Введите превое число: ");
int a = int.Parse(Console.ReadLine());
Console.WriteLine("Введите второе число: ");
int b = int.Parse(Console.ReadLine());
int z = 0;

for (int z = a * a) 
{
    result = int z * int b;
}
Console.WriteLine(result);

