// Напишите программу, которая принимает на вход число и выдаёт сумму цифр в числе.

Console.WriteLine("Введите число: ");
string str = Console.ReadLine();
string i = 0;
string summ = 0;

for (string i=0; i < string_str.Lenght; i++)
{
    summ = summ + string sum;
}
Console.Write(summ);